## Plan Result (ptlsbox_jenkins)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 9 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment
  * module.postgresql.terraform_data.trigger_password_reset
* Update
  * azurerm_cosmosdb_account.cosmosdb
  * azurerm_key_vault_secret.logicappsecret
  * azurerm_managed_disk.disk
  * module.jenkins-webhook-relay.azurerm_api_connection.connection
  * module.jenkins-webhook-relay.azurerm_logic_app_integration_account.this
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
* Replace
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_account.cosmosdb will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "cosmosdb" {
        id                                       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
        name                                     = "sandbox-pipeline-metrics"
      ~ tags                                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (32 unchanged attributes hidden)

      + identity {
          + identity_ids = [
              + "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/managed-identities-cftsbox-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/monitoring-cftsbox-intsvc-mi",
            ]
          + type         = "UserAssigned"
        }

        # (5 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "monitoring_mi_assignment" {
      + account_name        = "sandbox-pipeline-metrics"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "be502cec-0677-4715-b7a9-bd9c104909a7"
      + resource_group_name = "pipelinemetrics-database-sandbox"
      + role_definition_id  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/pipelinemetrics-database-sandbox/providers/Microsoft.DocumentDB/databaseAccounts/sandbox-pipeline-metrics"
    }

  # azurerm_key_vault_secret.logicappsecret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "logicappsecret" {
        id                      = "https://cftsbox-intsvc.vault.azure.net/secrets/github-jenkins-ptlsbox-logicapp/5768e6d3e76f4cd4ad9e8977a3ccb99e"
        name                    = "github-jenkins-ptlsbox-logicapp"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_managed_disk.disk will be updated in-place
  ~ resource "azurerm_managed_disk" "disk" {
        id                                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/DISKS-PTLSBOX-RG/providers/Microsoft.Compute/disks/jenkins-disk"
        name                              = "jenkins-disk"
      ~ tags                              = {
            "application"  = "core"
          ~ "builtFrom"    = "hmcts/aks-cft-deploy" -> "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (19 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_api_connection.connection will be updated in-place
  ~ resource "azurerm_api_connection" "connection" {
        id                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
        name                = "github-sb-jenkins-con"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_integration_account.this will be updated in-place
  ~ resource "azurerm_logic_app_integration_account" "this" {
        id                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.Logic/integrationAccounts/github-jenkins-cft-ptlsbox"
        name                = "github-jenkins-cft-ptlsbox"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                               = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.Logic/workflows/github-jenkins-cft-ptlsbox"
        name                             = "github-jenkins-cft-ptlsbox"
      ~ parameters                       = {
          - "$connections" = jsonencode(
                {
                  - servicebus_1 = {
                      - connectionId   = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
                      - connectionName = "servicebus-connection"
                      - id             = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
                    }
                }
            ) -> null
        }
      ~ tags                             = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      ~ workflow_parameters              = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
        id                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.Resources/deployments/logic-app-deployment"
        name                = "logic-app-deployment"
      ~ output_content      = jsonencode(
            {
              - callbackUrl = {
                  - type  = "String"
                  - value = "https://prod-07.uksouth.logic.azure.com:443/workflows/d9985e8c33ef4ba4a59381be7bcb917b/triggers/manual/paths/invoke?api-version=2017-07-01&sp=%2Ftriggers%2Fmanual%2Frun&sv=1.0&sig=tdcat9WqAlTW1wWyZCZP_iZubHdibSytpzLttjDfaS4"
                }
            }
        ) -> (known after apply)
      ~ parameters_content  = jsonencode(
          ~ {
              - rg                     = {
                  - value = ""
                }
              - servicebus_queue       = {
                  - value = "jenkins"
                }
                # (6 unchanged attributes hidden)
            }
        )
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-pact-broker-data-ptlsbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/cft-pact-broker-ptlsbox"
        name                          = "cft-pact-broker-ptlsbox"
      ~ tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + output = (known after apply)
    }

  # module.jenkins-webhook-relay.module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptlsbox"
        name                                = "github-jenkins-cft-ptlsbox"
      ~ tags                                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "github-jenkins-cft-ptlsbox"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "github-jenkins-cft-ptlsbox-rg"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ batched_operations_enabled              = true -> (known after apply)
      ~ express_enabled                         = false -> (known after apply)
      ~ id                                      = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptlsbox/queues/jenkins" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "jenkins"
      ~ namespace_id                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptlsbox" # forces replacement -> (known after apply) # forces replacement
      ~ partitioning_enabled                    = false -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptlsbox/queues/jenkins/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptlsbox/queues/jenkins" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.module.servicebus-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptlsbox/queues/jenkins/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/github-jenkins-cft-ptlsbox-rg/providers/Microsoft.ServiceBus/namespaces/github-jenkins-cft-ptlsbox/queues/jenkins" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 9 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Target":"ptlsbox_jenkins","Vars":{}} -->